app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "English"], ["room_number", 5], ["created_at", "2020-02-25 22:44:02.026020"], ["updated_at", "2020-02-25 22:44:02.026020"]]
---
  def create
    @schoolclass= SchoolClass.create(schoolclass_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 5], ["updated_at", "2020-02-25 22:48:01.836916"], ["id", 3]]
---
  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(schoolclass_params)